In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
names = lambda obj: print(name for name in dir(obj) if name[0] != "_")

In [4]:
generator = np.random.Generator(np.random.PCG64(seed = 0))

### Series Pandas
### DataFrame Pandas

In [26]:
s = pd.Series(data = [3, 5, 4, 6, 1, 2]) #Unidimensionales

In [27]:
s2 = pd.Series(data = [3, 5, 4, 6, 1, 2], index = list("ABCDEF"))

In [14]:
df = pd.DataFrame(
    data = generator.integers(0, 10, size = (6, 4)),
    columns = ["ene", "feb", "mar", "abr"],
    index = list("ABCDEF")
)
df #

   ene  feb  mar  abr
A    0    0    3    8
B    4    7    3    2
C    7    8    0    0
D    6    3    5    1
E    8    4    8    7
F    7    2    7    0

In [19]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [22]:
tips = sns.load_dataset("tips")
iris = sns.load_dataset("iris")
titanic = sns.load_dataset("titanic")

# Exploración de estructuras Pandas

In [23]:
type(tips)

pandas.core.frame.DataFrame

In [28]:
type(s)

pandas.core.series.Series

In [29]:
type(s2)

pandas.core.series.Series

In [30]:
#Metodos para visualizar estructuras pandas

In [31]:
s.head() #Muestra primeros cinco elementos de la estructura panda

0    3
1    5
2    4
3    6
4    1
dtype: int64

In [32]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [35]:
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [37]:
s2.tail()

B    5
C    4
D    6
E    1
F    2
dtype: int64

In [39]:
titanic.tail() #muestra los ultimos 5 elementos de una serie o dataframe panda

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [41]:
iris.tail(9)

     sepal_length  sepal_width  petal_length  petal_width    species
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [45]:
s.sample() #extrae un numero aleatorio de los valores

1    5
dtype: int64

In [44]:
s.sample(3)

2    4
3    6
5    2
dtype: int64

In [46]:
tips.sample(8)

     total_bill   tip     sex smoker   day    time  size
141       34.30  6.70    Male     No  Thur   Lunch     6
126        8.52  1.48    Male     No  Thur   Lunch     2
169       10.63  2.00  Female    Yes   Sat  Dinner     2
52        34.81  5.20  Female     No   Sun  Dinner     4
0         16.99  1.01  Female     No   Sun  Dinner     2
94        22.75  3.25  Female     No   Fri  Dinner     2
102       44.30  2.50  Female    Yes   Sat  Dinner     3
188       18.15  3.50  Female    Yes   Sun  Dinner     3

In [50]:
s

0    3
1    5
2    4
3    6
4    1
5    2
dtype: int64

In [51]:
s.describe() #nos muestra información estadistica sobre las variables numericas
#paso el metodo describe a s, que es una serie pandas, y nos devuelve una serie pandas

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [52]:
tips.describe() #si aplico el mismo metodo a un dataframe, me devuelve otro. solo obtengo info estadística de las
#variables numericas

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [53]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [54]:
#un array np solo contiene elementos de un solo tipo. Al igual que una serie pandas
#Pero en un dataframe pandas, eso no ocurre. Cada columna puede contener un tipo de dato distinto

In [56]:
s.dtype

dtype('int64')

In [58]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [59]:
#Cada columna de un dataframe pandas es una serie pandas

## Extraer valores de un dataframe pandas

In [69]:
tips["tip"] #Extraigo columna en formato serie pandas #metodo 1. Este es el mas recomendado

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [63]:
tips.tip #metodo 2

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [65]:
tips["size"].head()

0    2
1    3
2    3
3    2
4    4
Name: size, dtype: int64

In [67]:
tips.size #atributo de dataframe que me devuelve el numero total de valores de un dataframe. O sea, columnas por filas.  1708 celdas

1708

In [68]:
#del tips["tip"] esta es la forma adecuada para borrar una columna de un dataframe

In [71]:
s.value_counts() #nº de elementos distintos que aparece en la serie y el nº de veces que aparece cada uno de los elementos

3    1
5    1
4    1
6    1
1    1
2    1
Name: count, dtype: int64

In [72]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [75]:
tips.day.value_counts() #aplica el metodo para una sola columna. Formato serie pandas

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [77]:
tips.value_counts() #el metodo tmb existe para dataframes

total_bill  tip    sex     smoker  day   time    size
13.00       2.00   Female  Yes     Thur  Lunch   2       2
3.07        1.00   Female  Yes     Sat   Dinner  1       1
22.23       5.00   Male    No      Sun   Dinner  2       1
20.69       2.45   Female  No      Sat   Dinner  4       1
            5.00   Male    No      Sun   Dinner  5       1
                                                        ..
15.53       3.00   Male    Yes     Sat   Dinner  2       1
15.69       1.50   Male    Yes     Sun   Dinner  2       1
            3.00   Male    Yes     Sat   Dinner  3       1
15.77       2.23   Female  No      Sat   Dinner  2       1
50.81       10.00  Male    Yes     Sat   Dinner  3       1
Name: count, Length: 243, dtype: int64

In [78]:
#en el ejm de arriba solo hay dos apariciones con esa combinacion. De resto no se repite nada, nunca

In [81]:
tips.value_counts(subset = ["sex", "smoker", "day", "time"]) #parametro subset nos permite filtrar el dataframe 
#segun unas ciertas columnas

sex     smoker  day   time
Male    No      Sun   Dinner    43
                Sat   Dinner    32
        Yes     Sat   Dinner    27
Female  No      Thur  Lunch     24
Male    No      Thur  Lunch     20
Female  Yes     Sat   Dinner    15
Male    Yes     Sun   Dinner    15
Female  No      Sun   Dinner    14
                Sat   Dinner    13
Male    Yes     Thur  Lunch     10
Female  Yes     Thur  Lunch      7
Male    Yes     Fri   Dinner     5
Female  Yes     Fri   Dinner     4
                Sun   Dinner     4
Male    Yes     Fri   Lunch      3
Female  Yes     Fri   Lunch      3
Male    No      Fri   Dinner     2
Female  No      Thur  Dinner     1
                Fri   Lunch      1
                      Dinner     1
Name: count, dtype: int64